nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_mipi.c
	//reset camera
	//power down to low
	BOARD_Camera_pwd_io_set(0);
	//reset 
	BORAD_Camera_rst_io_set(0);
	rt_thread_delay(10);
	BORAD_Camera_rst_io_set(1);
	rt_thread_delay(10);
	
	#ifdef SENSOR_OV5640
	imx_cam_sensor_readb2_reg(i2c_bus,cam->sensor_addr,OV5640_CHIP_ID, &cam->sensor_id);
	if(cam->sensor_id == OV5640_ID)
	{
		ov5640_init(&cam->sensor);
		cam->sensor.isMipi = 1;
	}
	
	#endif
	#ifdef RT_USING_MIPI_CSI
	imx_cam_sensor_mipi_init();
	#endif
	return true;
}

int imxrt_camera_set_framerate(struct imxrt_camera *cam,framerate_t framerate)
{
    if (cam->sensor.framerate == framerate) {
       /* no change */
        return 0;
    }

#ifdef 	SOC_IMXRT1170_SERIES
#else		
	if (framerate & 0x80000000)
		CCM->CSCDR3 = framerate & (0x1F<<9);
#endif
    if (cam->sensor.set_framerate == NULL
        || cam->sensor.set_framerate(&cam->sensor, framerate) != 0) {
        /* operation not supported */
        return -1;
    }
	
	/* set the frame rate */
    cam->sensor.framerate = framerate;
	
	#ifdef RT_USING_MIPI_CSI
	imx_cam_sensor_mipi_cfg(cam);
	#endif

    return 0;
}

void imx_cam_reset(struct imxrt_camera *cam)
{
	//sensor init
	imx_cam_sensor_init(cam);
	//csi init
	CsiFragModeInit(cam->csi_base);
	csi_calc_first = 0;
	cam->sensor.isWindowing = 0;
	cam->sensor.wndH = cam->sensor.fb_h;
	cam->sensor.wndW = cam->sensor.fb_w;
	cam->sensor.wndX = cam->sensor.wndY = 0;	
	
	cam->sensor.sde          = 0xFF;
    cam->sensor.pixformat    = 0xFF;
    cam->sensor.framesize    = 0xFF;
    cam->sensor.framerate    = FRAMERATE_30FPS;
    cam->sensor.gainceiling  = 0xFF;


    // Call sensor-specific reset function; in the moment,we use our init function and defaults regs
    if (cam->sensor.reset)
		cam->sensor.reset(&cam->sensor);
	
	PGMC_BPC4->BPC_POWER_CTRL |= (PGMC_BPC_BPC_POWER_CTRL_PSW_ON_SOFT_MASK | PGMC_BPC_BPC_POWER_CTRL_ISO_OFF_SOFT_MASK);
}



#if defined(__CC_ARM)
#define ARMCC_ASM_FUNC	__asm
ARMCC_ASM_FUNC __attribute__((section(".ram_code"))) uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	push	{r4-r7, lr}
10
	LDMIA	R0!, {r3-r6}
	// schedule code carefully to allow dual-issue on Cortex-M7
	bfi		r7, r3, #0, #8	// Y0
	bfi		ip, r5, #0, #8	// Y4
	lsr		r3,	r3,	#16
	lsr		r5,	r5,	#16
	bfi		r7, r3, #8, #8	// Y1
	bfi		ip, r5, #8, #8  // Y5
	bfi		r7, r4, #16, #8 // Y2
	bfi		ip, r6, #16, #8 // Y6
	lsr		r4,	r4,	#16
	lsr		r6,	r6,	#16
	bfi		r7, r4, #24, #8 // Y3
	bfi		ip, r6, #24, #8	// Y7
	STMIA	r1!, {r7, ip}
	
	subs	r2,	#1
	bne		%b10
	mov		r0,	r1
	pop		{r4-r7, pc}
}
#elif defined(__CLANG_ARM)
__attribute__((section(".ram_code"))) uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	__asm (
		"	push	{r1-r7, ip, lr}  \n "
		"10:  \n "
		"	ldmia	r0!, {r3-r6}  \n "
			// schedule code carefully to allow dual-issue on Cortex-M7
		"	bfi		r7, r3, #0, #8  \n "	// Y0
		"	bfi		ip, r5, #0, #8  \n "	// Y4
		"	lsr		r3,	r3,	#16  \n "
		"	lsr		r5,	r5,	#16  \n "
		"	bfi		r7, r3, #8, #8  \n "	// Y1
		"	bfi		ip, r5, #8, #8  \n "  // Y5
		"	bfi		r7, r4, #16, #8  \n " // Y2
		"	bfi		ip, r6, #16, #8  \n " // Y6
		"	lsr		r4,	r4,	#16  \n "
		"	lsr		r6,	r6,	#16  \n "
		"	bfi		r7, r4, #24, #8  \n " // Y3
		"	bfi		ip, r6, #24, #8  \n "	// Y7
		"	stmia	r1!, {r7, ip}  \n "	
		"	subs	r2,	#1  \n "
		"	bne		10b  \n "
		"	mov		r0,	r1  \n "
		"	pop		{r1-r7, ip, pc}  \n "		
	);
	
	return 0;
}
#else
__attribute__((naked))
RAM_CODE uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	__asm volatile (
		"	push	{r1-r7, ip, lr}  \n "
		"10:  \n "
		"	ldmia	r0!, {r3-r6}  \n "
			// schedule code carefully to allow dual-issue on Cortex-M7
		"	bfi		r7, r3, #0, #8  \n "	// Y0
		"	bfi		ip, r5, #0, #8  \n "	// Y4
		"	lsr		r3,	r3,	#16  \n "
		"	lsr		r5,	r5,	#16  \n "
		"	bfi		r7, r3, #8, #8  \n "	// Y1
		"	bfi		ip, r5, #8, #8  \n "  // Y5
		"	bfi		r7, r4, #16, #8  \n " // Y2
		"	bfi		ip, r6, #16, #8  \n " // Y6
		"	lsr		r4,	r4,	#16  \n "
		"	lsr		r6,	r6,	#16  \n "
		"	bfi		r7, r4, #24, #8  \n " // Y3
		"	bfi		ip, r6, #24, #8  \n "	// Y7
		"	stmia	r1!, {r7, ip}  \n "	
		"	subs	r2,	#1  \n "
		"	bne		10b  \n "
		"	mov		r0,	r1  \n "
		"	pop		{r1-r7, ip, pc}  \n "		
	);
}

#endif
#if defined(__CC_ARM) || defined(__CLANG_ARM)
__attribute__((section(".ram_code"))) __attribute__((naked)) void rgb32Torgb565(uint32_t *src, uint16_t *dst, uint32_t len){
#else 
__attribute__((naked)) void rgb32Torgb565(uint32_t *src, uint16_t *dst, uint32_t len){	
#endif
	__asm volatile(
	"push {r3-r11, lr} \n"	
	// handle the remaining 8bytes first 
	"loop: \n"
	"	ldmia r0!, {r4-r11} \n"
	
	"	lsrs r4, #3 \n"      // pix 1
	"	lsls r5, #8 \n"		// pix 2

	"	ubfx r3,r4,#8+2-3, #6 \n"  //green
	"	ubfx ip,r5,#8+2+8, #6 \n"
	
	"	bfi r4,r3,#0+5,#6 \n"
	"	bfi r5,ip,#16+5,#6 \n"
	
	"	ubfx r3,r4,#16+3-3,#5 \n" //red
	"	ubfx ip,r5,#3+8,#5 \n"   //blue

	"	bfi r4,r3,#5+6,#5 \n"
	"	bfi r5,ip,#16,#5 \n"
	
	"	bfi r5,r4,#0,#16 \n"
	"	nop \n"
	
	"	lsrs r6, #3 \n"      // pix 3
	"	lsls r7, #8 \n"		// pix 4

	"	ubfx r3,r6,#8+2-3, #6 \n"  //green
	"	ubfx ip,r7,#8+2+8, #6 \n"
	
	"	bfi r6,r3,#0+5,#6 \n"
	"	bfi r7,ip,#16+5,#6 \n"
	
	"	ubfx r3,r6,#16+3-3,#5 \n" //red
	"	ubfx ip,r7,#3+8,#5 \n"   //blue

	"	bfi r6,r3,#5+6,#5 \n"
	"	bfi r7,ip,#16,#5 \n"
	
	"	bfi r7,r6,#0,#16 \n"
	"	nop \n"
	
	"	lsrs r8, #3 \n"      // pix 5
	"	lsls r9, #8 \n"		// pix 6

	"	ubfx r3,r8,#8+2-3, #6 \n"  //green
	"	ubfx ip,r9,#8+2+8, #6 \n"
	
	"	bfi r8,r3,#0+5,#6 \n"
	"	bfi r9,ip,#16+5,#6 \n"
	
	"	ubfx r3,r8,#16+3-3,#5 \n" //red
	"	ubfx ip,r9,#3+8,#5 \n"   //blue

	"	bfi r8,r3,#5+6,#5 \n"
	"	bfi r9,ip,#16,#5 \n"
	
	"	bfi r9,r8,#0,#16 \n"
	"	nop \n"
	
	"	lsrs r10, #3 \n"      // pix 7
	"	lsls r11, #8 \n"		// pix 8

	"	ubfx r3,r10,#8+2-3, #6 \n"  //green
	"	ubfx ip,r11,#8+2+8, #6 \n"
	
	"	bfi r10,r3,#0+5,#6 \n"
	"	bfi r11,ip,#16+5,#6 \n"
	
	"	ubfx r3,r10,#16+3-3,#5 \n" //red
	"	ubfx ip,r11,#3+8,#5 \n"   //blue

	"	bfi r10,r3,#5+6,#5 \n"
	"	bfi r11,ip,#16,#5 \n"
	
	"	bfi r11,r10,#0,#16 \n"
	"	nop \n"
		
	"	stmia r1!,{r5,r7,r9,r11} \n"
	"	subs r2, #32 \n"
	"	bne loop \n"
	"	pop {r3-r11, pc} \n"		
		);
}
void rgb32Torgb565_c(uint32_t *src, uint16_t *dst, uint32_t len){
	uint8_t r,g,b;
	for(int i=0;i<len;i+=4){
		uint32_t col = *(src++);
		r = (col>>16) & 0xff;
		g = (col>>8) & 0xff;
		b = col & 0xff;
		*dst++ = ((r >> 3) << 11) | ((g>>2)<<5) | ((b>>3));	
	}
}

