nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_mipi.c
__attribute__((naked)) void copy2mem(void* dst, void* src, uint32_t len){
	__asm volatile(
		"push {r3-r4, lr}\n"
		"loop1: \n"
		"ldrd r3, r4, [r1], #8\n"
		"strd r3, r4, [r0], #8\n"
		"subs r2, #8\n"
		"bne loop1\n"
		"pop {r3-r4, lr}\n"
		);
}

uint64_t rt_tick_get_us(){
	uint64_t tick = rt_tick_get();
	uint64_t us = 1000000 * (SysTick->LOAD - SysTick->VAL) / SystemCoreClock;
	us += tick * 1000;
	return us;
}
uint32_t g_start,g_s1,g_e1, g_csi_end;
uint64_t g_csi_start, g_exit;
int32_t irq_time = 0;
static int sync_found = 0;

bool SOF = true;

volatile int a = 0;
volatile int enter_irq = 0;
#if defined(__CC_ARM) || defined(__CLANG_ARM)
__attribute__((section(".ram_code"))) void CSI_IRQHandler(void) {
#else
void CSI_IRQHandler(void) {
#endif	
	enter_irq ++;
	if (pCam == NULL)
		return;
	rt_interrupt_enter();
	#ifdef GPIO_DEBUGING 
	HIGH(NNCU_RATE);
	#endif
    volatile uint32_t csisr = pCam->csi_base->CSISR;
	if((csisr & (1<<24))){
		a++;
	#ifdef GPIO_DEBUGING 	
		HIGH(NNCU_INVOKE_RATE);
	#endif	
	}
    /* Clear the error flags. */
    pCam->csi_base->CSISR = csisr;

	if ((csisr & (1<<16)) && (SOF)) {
		// indicate the first SOF
		SOF = false;
		//find a buffer
		if (!sync_found)
		{
			vbuffer_t *buffer = framebuffer_get_tail(FB_NO_FLAGS);
			if (!buffer) 
			{
				framebuffer_flush_buffers();
				return;
			}
			pCam->s_irq.base0 = (uint32_t)buffer->data;
			imx_cam_csi_start_frame(pCam);
		}
		sync_found = 1;
		//               SOF    | FB1    | FB2    irqEn
		pCam->csi_base->CSICR1 = 1U<<16 | 1U<<19 | 1U<<20 | CSICR1_INIT_VAL;
		//				 16 doubleWords| RxFifoDmaReqEn| ReflashRFF|ResetFrmCnt
		pCam->csi_base->CSICR3 = 2<<4          | 1<<12         | 1<<14     |1<<15;	
		#ifdef GPIO_DEBUGING 
		HIGH(CSI_FRAME_RATE);
		#endif
		
	}else if(csisr & (3<<19))
	{
		uint32_t dmaBase, lineNdx = pCam->s_irq.dmaFragNdx * pCam->s_irq.linePerFrag;
			if (pCam->s_irq.dmaFragNdx & 1)
				dmaBase = pCam->csi_base->CSIDMASA_FB2;
			else
				dmaBase = pCam->csi_base->CSIDMASA_FB1;

		// we use the dma only transfer one frame, update the dma base and flash as soon as possible
		if (csisr & (1<<19) ) {
			if (pCam->s_irq.isGray)
				pCam->csi_base->CSIDMASA_FB1 += 2 * pCam->s_irq.dmaBytePerFrag; // two buffer, need multi 2
		} else {
			if (pCam->s_irq.isGray)
				pCam->csi_base->CSIDMASA_FB2 += 2 * pCam->s_irq.dmaBytePerFrag;
			pCam->csi_base->CSICR3 |= CSI_CSICR3_DMA_REFLASH_RFF_MASK;	// reflash DMA
			__DSB();
		}
		if (dmaBase >= 0x20200000)
			DCACHE_CleanInvalidateByRange(dmaBase, pCam->s_irq.dmaBytePerFrag);
		if (pCam->s_irq.isGray)
		{
			/* cost too much time
			if(pCam->sensor.isWindowing &&  lineNdx >= pCam->sensor.wndY && lineNdx - pCam->sensor.wndY <= pCam->sensor.wndH)
			{
				dmaBase += pCam->sensor.wndX * pCam->s_irq.linePerFrag;	// apply line window offset, does not begin from the 0,0, need follow
				uint32_t byteToCopy = (pCam->sensor.wndW * pCam->s_irq.linePerFrag);
				copy2mem((void*)pCam->s_irq.datCurBase, (void*)dmaBase, byteToCopy);
				pCam->s_irq.datCurBase += byteToCopy;
			}
			*/
		}
		else{
			uint32_t byteToCopy = pCam->s_irq.dmaBytePerFrag;
			bool copy_window = false;
			if(pCam->sensor.isWindowing &&  lineNdx >= pCam->sensor.wndY && lineNdx - pCam->sensor.wndY <= pCam->sensor.wndH)
			{
				copy_window = true;
				dmaBase += pCam->sensor.wndX * 4 * pCam->s_irq.linePerFrag;	// apply line window offset, does not begin from the 0,0, need follow, 4 means RGB8888
				byteToCopy = (pCam->sensor.wndW * pCam->s_irq.linePerFrag) << 2; // rgb8888 one pixel
			}
			// handler the XRGB8888 to rgb565 line by line directly, seems that costs too much time
			if(!pCam->sensor.isWindowing || copy_window){
				rgb32Torgb565((uint32_t*)dmaBase, (uint16_t*)pCam->s_irq.datCurBase, byteToCopy);
				pCam->s_irq.datCurBase += byteToCopy >> 1; //rgb565 in mem
			}
		}
		
		if (++pCam->s_irq.dmaFragNdx == pCam->s_irq.fragCnt || (csisr & (3<<19)) == 3<<19 )
		{
			SOF = true;
			#ifdef GPIO_DEBUGING 
			LOW(CSI_FRAME_RATE);
			#endif
			//				 16 doubleWords| ReflashRFF
			pCam->csi_base->CSICR3 = 2<<4		   | 1<<14;
			//send evt to cam thread
			rt_event_send(&frame_event, EVENT_CSI);

			sync_found = 0;
			
			
			if(isToStopCSICommand)
			{
				NVIC_DisableIRQ(CSI_IRQn);
				CSI_Stop(CSI);
				isToStopCSICommand = 0;
				g_csi_int_en = 1;
				struct rt_camera_device *sensor = imxrt_camera_device_find(SENSOR_NAME);
				sensor->status = RT_CAMERA_DEVICE_INIT;
			}
			else
			{
				
			}
		}
		
	}
Cleanup:
#ifdef GPIO_DEBUGING 	
	LOW(NNCU_RATE);
	LOW(NNCU_INVOKE_RATE);
#endif	
	rt_interrupt_leave();
	return;
}

void imx_cam_csi_fragmode_calc(struct imxrt_camera *cam) {
	
	cam->s_irq.dmaBytePerLine = cam->sensor.fb_w * 4;
	if (cam->sensor.pixformat == PIXFORMAT_GRAYSCALE) {
		cam->s_irq.dmaBytePerLine /= 4;
		cam->s_irq.isGray = 1;
		cam->sensor.hw_flags.gs_bpp = 1;
	} else {
		cam->s_irq.isGray = 0;
		cam->sensor.hw_flags.gs_bpp = 2;
	}
	if (cam->sensor.fb_w == 0 || cam->sensor.fb_h == 0)
		return;

	// calculate max bytes per DMA frag
	uint32_t dmaBytePerFrag, byteStep, dmaByteTotal;
	uint32_t maxBytePerLine = sizeof(s_dmaFragBufs) / ARRAY_SIZE(s_dmaFragBufs);
	dmaByteTotal = cam->s_irq.isGray?cam->sensor.fb_w * cam->sensor.fb_h:cam->sensor.fb_w * cam->sensor.fb_h * 4; // now only the grayscale did not need to re-do	
	if (cam->sensor.wndX == 0 && cam->sensor.wndY == 0) // (s_irq.isGray)
	{
		dmaBytePerFrag = cam->s_irq.dmaBytePerLine;  // set a minial default value
		for (byteStep = cam->s_irq.dmaBytePerLine; byteStep < maxBytePerLine; byteStep += cam->s_irq.dmaBytePerLine) {
			if (0 == byteStep % 32 )
			{
				// find maximum allowed bytes per frag
				dmaBytePerFrag = (maxBytePerLine / byteStep) * byteStep;
				for (; dmaBytePerFrag >= byteStep; dmaBytePerFrag -= byteStep) {
					if (dmaByteTotal % dmaBytePerFrag == 0)
						break;
				}
				if (dmaBytePerFrag < byteStep) {
					dmaBytePerFrag = byteStep;
					while (1) {}
				}
				break;
			}
		}
	} 
	else {
		// for window mode, we only accept 1 line per frag
		dmaBytePerFrag = cam->s_irq.dmaBytePerLine;
	}
	cam->s_irq.linePerFrag = dmaBytePerFrag / cam->s_irq.dmaBytePerLine;
	cam->s_irq.dmaBytePerFrag = dmaBytePerFrag;

