nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_mipi.c
	// >>> calculate how many lines per fragment (DMA xfer unit)
	uint32_t burstBytes;
	if (!(cam->s_irq.dmaBytePerLine % (8 * 16)))
	{
		burstBytes = 128;
		cam->csi_base->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(3U);
		cam->csi_base->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((7U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	else if (!(cam->s_irq.dmaBytePerLine % (8 * 8)))
	{
		burstBytes = 64;
		cam->csi_base->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(2U);
		cam->csi_base->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((1U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	else
	{
		burstBytes = 32;
		cam->csi_base->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(1U);
		cam->csi_base->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((0U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	cam->s_irq.fragCnt = cam->sensor.fb_h / cam->s_irq.linePerFrag;
	// <<<
}

#define enable_camera() \
//	pCam->sensor.sleep(&pCam->sensor, false); \
//	for(int i=0;i<1000000;i++); \
//	imx_cam_sensor_cambus_writeb2(&pCam->sensor, pCam->sensor.slv_addr, 0x3007, 0xff); \
//	imx_cam_sensor_cambus_writeb2(&pCam->sensor, pCam->sensor.slv_addr, 0x3008, 0x02); \
//	rt_thread_mdelay(10);

#define disable_camera() \
//	pCam->sensor.sleep(&pCam->sensor, true); \
//	imx_cam_sensor_cambus_writeb2(&pCam->sensor, pCam->sensor.slv_addr, 0x3007, 0xe7); \
//	imx_cam_sensor_cambus_writeb2(&pCam->sensor, pCam->sensor.slv_addr, 0x3008, 0x42); \
//	rt_thread_mdelay(10);

bool g_first_start;
void imx_cam_csi_start_frame(struct imxrt_camera *cam)
{	
	uint32_t start = rt_tick_get_us();
	if(!g_first_start) {
		imx_cam_csi_fragmode_calc(cam);
		g_first_start = true;
	}
	cam->s_irq.dmaFragNdx = 0;
	cam->s_irq.cnt++;
	// DMA also writes to this cache line, to avoid being invalidated, clean MAIN_FB header.
	DCACHE_CleanByRange((uint32_t)cam->s_irq.base0, 32);
	if (cam->s_irq.isGray){
		cam->csi_base->CSIDMASA_FB1 = (uint32_t) cam->s_irq.base0;
		cam->csi_base->CSIDMASA_FB2 = (uint32_t) cam->s_irq.base0 + cam->s_irq.dmaBytePerFrag;
	} else {
		// re-use the s_dmaFragBufs, handle the RGB8888 to rgb565
		cam->csi_base->CSIDMASA_FB1 = (uint32_t) s_dmaFragBufs[0];
		cam->csi_base->CSIDMASA_FB2 = (uint32_t) s_dmaFragBufs[1];
	}
	cam->s_irq.datCurBase = cam->s_irq.base0;
	cam->csi_base->CSICR1 = CSICR1_INIT_VAL;
	if (cam->s_irq.dmaBytePerFrag & 0xFFFF0000) {
		
		uint32_t l16 = cam->s_irq.linePerFrag , h16 = cam->s_irq.dmaBytePerLine << 16;
		cam->csi_base->CSIIMAG_PARA = l16 | h16;
	} else {
		#if 1
		cam->csi_base->CSIIMAG_PARA = cam->s_irq.linePerFrag | (cam->sensor.fb_w) << 16;	// set xfer cnt
		#else
		cam->csi_base->CSIIMAG_PARA = cam->s_irq.linePerFrag | dmaBytePerFrag << 16;
		#endif
	}
	__set_PRIMASK(1);
	cam->csi_base->CSISR = cam->csi_base->CSISR;
	cam->csi_base->CSICR1 |= 1<<16;	// enable SOF iRQ
	cam->csi_base->CSICR18 |= 1U<<31;	// start CSI
	NVIC_EnableIRQ(CSI_IRQn);
	enable_camera();
	g_csi_int_en = 1;
	__set_PRIMASK(0);
}

void imx_cam_start_snapshot(struct imxrt_camera *cam)
{
	pCam = cam;
	//start csi
	uint8_t bpp;
	int16_t w,h;
	uint32_t size;
	
	w = cam->sensor.isWindowing ? cam->sensor.fb_w : resolution[cam->sensor.framesize][0];
	h = cam->sensor.isWindowing ? cam->sensor.fb_h : resolution[cam->sensor.framesize][1];
	switch (cam->sensor.pixformat) {
        case PIXFORMAT_GRAYSCALE:
            bpp = 1;
            break;
        case PIXFORMAT_YUV422:
        case PIXFORMAT_RGB565:
            bpp = 2;
            break;
        case PIXFORMAT_BAYER:
            bpp = 3;
            break;
        case PIXFORMAT_JPEG:
            // Read the number of data items transferred
            // MAIN_FB()->bpp = (MAX_XFER_SIZE - __HAL_DMA_GET_COUNTER(&DMAHandle))*4;
            break;
		default:
			bpp = 3;
			break;
    }
	
	size = w * h * bpp;

	framebuffer_set_buffers(3);
	imx_cam_csi_start_frame(cam);
}

void imx_cam_csi_stop(struct rt_camera_device *cam)
{
	cam->status = RT_CAMERA_DEVICE_SUSPEND;
	CSI_Stop(CSI);
	CSI->CSICR3 = 2<<4		   | 1<<14;
	NVIC_DisableIRQ(CSI_IRQn);
	SOF = true;
	g_csi_int_en = 0;
	g_first_start = 0;
}

void imx_cam_sensor_set_contrast(struct imxrt_camera *cam, uint32_t level)
{
	if (cam->sensor.set_contrast != NULL)
		cam->sensor.set_contrast(&cam->sensor,level);
}

void imx_cam_sensor_set_gainceiling(struct imxrt_camera *cam, gainceiling_t gainceiling)
{
	if (cam->sensor.set_gainceiling != NULL && !cam->sensor.set_gainceiling(&cam->sensor, gainceiling))
		cam->sensor.gainceiling = gainceiling;
}

int imx_cam_sensor_set_framesize(struct imxrt_camera *cam, framesize_t framesize)
{
	if(cam->sensor.set_framesize == NULL || cam->sensor.set_framesize(&cam->sensor,framesize) != 0)
		return -1;
	
	cam->sensor.framesize = framesize;
	
	cam->sensor.fb_w = resolution[framesize][0];
	cam->sensor.fb_h = resolution[framesize][1];
	
	cam->sensor.wndX = 0; cam->sensor.wndY = 0 ; cam->sensor.wndW = cam->sensor.fb_w ; cam->sensor.wndH = cam->sensor.fb_h;
	cam->sensor.isWindowing = 0;

	#ifdef RT_USING_MIPI_CSI
	imx_cam_sensor_mipi_cfg(cam);
	#endif
	return 0;
}

void imx_cam_sensor_set_pixformat(struct imxrt_camera *cam, pixformat_t pixformat)
{
	if (cam->sensor.set_pixformat == NULL || cam->sensor.set_pixformat(&cam->sensor,pixformat) != 0)
		return;
	if (cam->sensor.pixformat == pixformat)
		return;
	#ifdef RT_USING_LCD
	PXP_EnableCsc1(PXP, false);
	extern void LCDMonitor_SetPIXFORMAT(int format);
	LCDMonitor_SetPIXFORMAT(pixformat);
	#endif
	switch(pixformat){
		// this is special that grayscale will also use YCbCr(gray:Y, CbCr: 0x40), so need also
		// the color converter
		case PIXFORMAT_GRAYSCALE:
		// to enable the CSI binary mode
		cam->csi_base->CSICR20 |= 1<<31 | 1<<30 | 1<<12 | 4<<9; 	//QRCODE HISTORAGM ORDER INPUT
		case PIXFORMAT_YUV422:
			// Enale the Csc1 is not so well here, move them to update frambuffer
			// we just define it here
			#define ENABLE_PXP_CSC() \
					/* indicate that the Csc function is disable now, open it */ \
					if((PXP->CSC1_COEF1 & PXP_CSC1_COEF0_BYPASS_MASK)){ \
						/* enable the PXP's color converter */ \
						PXP_SetCsc1Mode(PXP, kPXP_Csc1YCbCr2RGB); \
						PXP_EnableCsc1(PXP, true); \
					}
		break;	
		default:
			break;
	}
	
